tests/cassettes/test_invoices/test_issue_invoice.yaml

interactions:
- request:
    body: '{"correlationId": "fb029397-2f5d-440a-ba56-911a7238eca4", "description":
      "Invoice for order 123", "amount": {"currency": "USD", "amount": "1.00"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '146'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.28.1
    method: POST
    uri: https://api.strike.me/v1/invoices
  response:
    body:
      string: '{"invoiceId":"e30fa3dd-27c9-45ae-8ffe-7930b405d62c","amount":{"currency":"USD","amount":"1.00"},"state":"UNPAID","created":"2022-11-04T20:31:25.4769904+00:00","correlationId":"fb029397-2f5d-440a-ba56-911a7238eca4","description":"Invoice
        for order 123","issuerId":"df7666c0-36bf-4ead-bed9-faef9188f96b","receiverId":"df7666c0-36bf-4ead-bed9-faef9188f96b"}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 76501cf78c0d6356-ORD
      Connection:
      - keep-alive
      Content-Length:
      - '354'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 04 Nov 2022 20:31:25 GMT
      Location:
      - https://api.strike.me/v1/invoices/e30fa3dd-27c9-45ae-8ffe-7930b405d62c
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=TcPRwTskf8WnUilnwLTlIvH6Ipg4j04RgHrt3KkH108-1667593885-0-AecJ/mus1Afwe5BZ2dToGQMTBGNBZvsCU7mRkQpBC46qVyg+vyjS6mVXfP//iLUeoAGFAJA7riDdavHamtltWUA=;
        path=/; expires=Fri, 04-Nov-22 21:01:25 GMT; domain=.strike.me; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=300; includeSubDomains
      Via:
      - 1.1 google
      X-Content-Type-Options:
      - nosniff
    status:
      code: 201
      message: Created
version: 1
