tests/cassettes/test_invoices/test_issue_invoice_for_handle.yaml

interactions:
- request:
    body: '{"correlationId": "8c0a978e-ace2-4105-81df-14269b983e43", "description":
      "Invoice for order 123", "amount": {"currency": "USD", "amount": "1.00"}}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '146'
      Content-Type:
      - application/json
      User-Agent:
      - python-requests/2.28.1
    method: POST
    uri: https://api.strike.me/v1/invoices/handle/chmoder
  response:
    body:
      string: '{"invoiceId":"23bf3150-3889-4852-b712-a9059af97d9f","amount":{"currency":"USD","amount":"1.00"},"state":"UNPAID","created":"2022-11-04T20:31:25.9052666+00:00","correlationId":"8c0a978e-ace2-4105-81df-14269b983e43","description":"Invoice
        for order 123","issuerId":"df7666c0-36bf-4ead-bed9-faef9188f96b","receiverId":"df7666c0-36bf-4ead-bed9-faef9188f96b"}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 76501cfa5e092ade-ORD
      Connection:
      - keep-alive
      Content-Length:
      - '354'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 04 Nov 2022 20:31:26 GMT
      Location:
      - https://api.strike.me/v1/invoices/23bf3150-3889-4852-b712-a9059af97d9f
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=4DNE084QxHWU20az7C79VqvDjlKqfPjB6Pu_OGZ57W8-1667593886-0-AWbUB2IcJqrPhNImiC1glyFRFBHUskPzqeqsYHjzQJ4MUBIJZVYxhYK/cZjkZccgRttWD+5ridUoC87srXv6U/8=;
        path=/; expires=Fri, 04-Nov-22 21:01:26 GMT; domain=.strike.me; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=300; includeSubDomains
      Via:
      - 1.1 google
      X-Content-Type-Options:
      - nosniff
    status:
      code: 201
      message: Created
version: 1
