tests/cassettes/test_invoices/test_issue_quote.yaml

interactions:
- request:
    body: null
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '0'
      User-Agent:
      - python-requests/2.28.1
    method: POST
    uri: https://api.strike.me/v1/invoices/5f8a40b4-910f-439d-9a61-81fae87f0a8e/quote
  response:
    body:
      string: '{"quoteId":"520b6082-185f-46e6-9b70-a72053420ca2","description":"Invoice
        for order 123","lnInvoice":"lnbc521300n1p3k2a57pp5a05nuumnylpuevn2jak6upra70lpnlvun2ra7wtsleg7tk4hvrxqdpzf9h8vmmfvdjjqen0wgsx7unyv4ezqvfjxvcqzpgxqzr4fppqnhlaufynawqhjwjrkvhuzpcm3nyu2543sp5t5hnj4k3999vqdpjez9ew0ma5w7s66nu2ct2v37jflr5v0y3j5qq9qyyssqsagc4knpgysl7d6wvz305hd8hqcz3tclzelt9est9c9ksx4dpuqhgeycdwmd7smdpnsnfdadwnq5q2yhxqllkaxar35jjhqgexvluaqp0mtuzx","onchainAddress":"bc1qnhlaufynawqhjwjrkvhuzpcm3nyu2543mpxwmn","expiration":"2022-11-04T20:33:24.716+00:00","expirationInSec":117,"targetAmount":{"currency":"USD","amount":"10.99"},"sourceAmount":{"currency":"BTC","amount":"0.0005213"},"conversionRate":{"amount":"21081.9106","sourceCurrency":"BTC","targetCurrency":"USD"}}'
    headers:
      CF-Cache-Status:
      - DYNAMIC
      CF-RAY:
      - 76501cfe6b0b2968-ORD
      Connection:
      - keep-alive
      Content-Length:
      - '754'
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 04 Nov 2022 20:31:26 GMT
      Location:
      - https://api.strike.me/v1/quotes/520b6082-185f-46e6-9b70-a72053420ca2
      Server:
      - cloudflare
      Set-Cookie:
      - __cf_bm=tdU0764lu4eZ.MmdE1W6pC26bTNRH4hpwv4sIP36FSY-1667593886-0-ARkCSJUpWoYVvr9o2zEKwB97M6wscQYgJsho58XyhpU49/br4/QRdkuLWhY4HdWT7xp3ZaSfj8wDnhK/MrsPKN0=;
        path=/; expires=Fri, 04-Nov-22 21:01:26 GMT; domain=.strike.me; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=300; includeSubDomains
      Via:
      - 1.1 google
      X-Content-Type-Options:
      - nosniff
    status:
      code: 201
      message: Created
version: 1
